; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    ; (can_traverse ?x ?y ?z)
    (at ?x ?y)
    ; (visible ?y ?z)
    )
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=3, waypoints=8, cameras=3, objectives=7, out_folder=training/easy, instance_id=70, seed=105

(define (problem rover-70)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 - rover
    rover1store rover2store rover3store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 - waypoint
    camera1 camera2 camera3 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 - objective)
 (:init 
    (at_lander general waypoint6)
    (at rover1 waypoint2)
    (at rover2 waypoint1)
    (at rover3 waypoint5)
    (equipped_for_soil_analysis rover1)
    (equipped_for_soil_analysis rover2)
    (equipped_for_rock_analysis rover3)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint8)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint6)
    (at_soil_sample waypoint8)
    (visible waypoint3 waypoint8)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint3 waypoint1)
    (visible waypoint8 waypoint7)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint8 waypoint3)
    (visible waypoint7 waypoint8)
    (visible waypoint5 waypoint3)
    (visible waypoint1 waypoint3)
    (visible waypoint3 waypoint5)
    (visible waypoint2 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint4 waypoint7)
    (visible waypoint7 waypoint4)
    (visible waypoint2 waypoint8)
    (visible waypoint8 waypoint2)
    (visible waypoint1 waypoint6)
    (visible waypoint6 waypoint1)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint1)
    (visible waypoint6 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint3 waypoint6)
    (visible waypoint6 waypoint3)
    (can_traverse rover1 waypoint3 waypoint8)
    (can_traverse rover1 waypoint1 waypoint2)
    (can_traverse rover1 waypoint2 waypoint1)
    (can_traverse rover1 waypoint3 waypoint4)
    (can_traverse rover1 waypoint4 waypoint3)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint8 waypoint7)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint8 waypoint3)
    (can_traverse rover1 waypoint7 waypoint8)
    (can_traverse rover1 waypoint5 waypoint3)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint3 waypoint5)
    (can_traverse rover1 waypoint2 waypoint4)
    (can_traverse rover1 waypoint4 waypoint2)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover1 waypoint4 waypoint7)
    (can_traverse rover1 waypoint7 waypoint4)
    (can_traverse rover2 waypoint3 waypoint8)
    (can_traverse rover2 waypoint1 waypoint2)
    (can_traverse rover2 waypoint2 waypoint1)
    (can_traverse rover2 waypoint3 waypoint4)
    (can_traverse rover2 waypoint4 waypoint3)
    (can_traverse rover2 waypoint3 waypoint1)
    (can_traverse rover2 waypoint8 waypoint7)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover2 waypoint8 waypoint3)
    (can_traverse rover2 waypoint7 waypoint8)
    (can_traverse rover2 waypoint5 waypoint3)
    (can_traverse rover2 waypoint1 waypoint3)
    (can_traverse rover2 waypoint3 waypoint5)
    (can_traverse rover2 waypoint2 waypoint8)
    (can_traverse rover2 waypoint8 waypoint2)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint1 waypoint5)
    (can_traverse rover2 waypoint5 waypoint1)
    (can_traverse rover2 waypoint3 waypoint6)
    (can_traverse rover2 waypoint6 waypoint3)
    (can_traverse rover3 waypoint3 waypoint8)
    (can_traverse rover3 waypoint1 waypoint2)
    (can_traverse rover3 waypoint2 waypoint1)
    (can_traverse rover3 waypoint3 waypoint4)
    (can_traverse rover3 waypoint4 waypoint3)
    (can_traverse rover3 waypoint3 waypoint1)
    (can_traverse rover3 waypoint8 waypoint7)
    (can_traverse rover3 waypoint4 waypoint6)
    (can_traverse rover3 waypoint6 waypoint4)
    (can_traverse rover3 waypoint8 waypoint3)
    (can_traverse rover3 waypoint7 waypoint8)
    (can_traverse rover3 waypoint5 waypoint3)
    (can_traverse rover3 waypoint1 waypoint3)
    (can_traverse rover3 waypoint3 waypoint5)
    (can_traverse rover3 waypoint2 waypoint8)
    (can_traverse rover3 waypoint8 waypoint2)
    (can_traverse rover3 waypoint1 waypoint5)
    (can_traverse rover3 waypoint5 waypoint1)
    (calibration_target camera1 objective2)
    (on_board camera1 rover2)
    (supports camera1 low_res)
    (supports camera1 colour)
    (supports camera1 high_res)
    (calibration_target camera2 objective5)
    (on_board camera2 rover2)
    (supports camera2 colour)
    (supports camera2 high_res)
    (calibration_target camera3 objective7)
    (on_board camera3 rover2)
    (supports camera3 colour)
    (visible_from objective1 waypoint4)
    (visible_from objective1 waypoint5)
    (visible_from objective1 waypoint8)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint7)
    (visible_from objective1 waypoint2)
    (visible_from objective2 waypoint5)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint7)
    (visible_from objective2 waypoint6)
    (visible_from objective2 waypoint8)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint7)
    (visible_from objective4 waypoint2)
    (visible_from objective4 waypoint3)
    (visible_from objective5 waypoint1)
    (visible_from objective5 waypoint7)
    (visible_from objective5 waypoint3)
    (visible_from objective5 waypoint4)
    (visible_from objective5 waypoint6)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint5)
    (visible_from objective5 waypoint8)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint8)
    (visible_from objective6 waypoint5)
    (visible_from objective7 waypoint3)
    (visible_from objective7 waypoint7)
    (visible_from objective7 waypoint1)
    (visible_from objective7 waypoint4)
    (visible_from objective7 waypoint6)
    (visible_from objective7 waypoint8)
    (visible_from objective7 waypoint2))
 (:goal  (and 
    (communicated_rock_data waypoint8)
    (communicated_rock_data waypoint3)
    (communicated_soil_data waypoint8)
    (communicated_soil_data waypoint4)
    (communicated_soil_data waypoint6)
    (communicated_image_data objective3 colour)
    (communicated_image_data objective2 colour)
    (communicated_image_data objective7 colour)
    (communicated_image_data objective2 high_res)
    (communicated_image_data objective1 colour)
    (communicated_image_data objective6 low_res)
    (communicated_image_data objective2 low_res)
    (communicated_image_data objective7 high_res)
    (communicated_image_data objective3 low_res)
    (communicated_image_data objective3 high_res)
    (communicated_image_data objective4 high_res)
    (communicated_image_data objective5 high_res)
    (communicated_image_data objective6 colour)
    (communicated_image_data objective7 low_res)
    (communicated_image_data objective4 colour)
    (communicated_image_data objective4 low_res)
    (communicated_image_data objective1 high_res)
    (communicated_image_data objective5 colour)
    (communicated_image_data objective1 low_res)
    (communicated_image_data objective6 high_res)
    (communicated_image_data objective5 low_res))))

; plan
1. (navigate rover1 waypoint2 waypoint4)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint4)
   goals met: 0 of 26
2. (navigate rover1 waypoint4 waypoint3)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint3)
   goals met: 0 of 26
3. (navigate rover1 waypoint3 waypoint8)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint8)
   goals met: 0 of 26
4. (sample_soil rover1 rover1store waypoint8)
   deleted: (empty rover1store) (at_soil_sample waypoint8)
   added: (full rover1store) (have_soil_analysis rover1 waypoint8)
   goals met: 0 of 26
5. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 26
6. (navigate rover1 waypoint8 waypoint3)
   deleted: (at rover1 waypoint8)
   added: (at rover1 waypoint3)
   goals met: 0 of 26
7. (communicate_soil_data rover1 general waypoint8 waypoint3 waypoint6)
   added: (communicated_soil_data waypoint8)
   goals met: 1 of 26
8. (navigate rover1 waypoint3 waypoint4)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint4)
   goals met: 1 of 26
9. (sample_soil rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_soil_sample waypoint4)
   added: (full rover1store) (have_soil_analysis rover1 waypoint4)
   goals met: 1 of 26
10. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 1 of 26
11. (communicate_soil_data rover1 general waypoint4 waypoint4 waypoint6)
   added: (communicated_soil_data waypoint4)
   goals met: 2 of 26
12. (navigate rover1 waypoint4 waypoint6)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint6)
   goals met: 2 of 26
13. (sample_soil rover1 rover1store waypoint6)
   deleted: (empty rover1store) (at_soil_sample waypoint6)
   added: (full rover1store) (have_soil_analysis rover1 waypoint6)
   goals met: 2 of 26
14. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 2 of 26
15. (navigate rover1 waypoint6 waypoint4)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint4)
   goals met: 2 of 26
16. (communicate_soil_data rover1 general waypoint6 waypoint4 waypoint6)
   added: (communicated_soil_data waypoint6)
   goals met: 3 of 26
17. (navigate rover3 waypoint5 waypoint3)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint3)
   goals met: 3 of 26
18. (navigate rover3 waypoint3 waypoint8)
   deleted: (at rover3 waypoint3)
   added: (at rover3 waypoint8)
   goals met: 3 of 26
19. (sample_rock rover3 rover3store waypoint8)
   deleted: (empty rover3store) (at_rock_sample waypoint8)
   added: (full rover3store) (have_rock_analysis rover3 waypoint8)
   goals met: 3 of 26
20. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 3 of 26
21. (navigate rover3 waypoint8 waypoint3)
   deleted: (at rover3 waypoint8)
   added: (at rover3 waypoint3)
   goals met: 3 of 26
22. (communicate_rock_data rover3 general waypoint8 waypoint3 waypoint6)
   added: (communicated_rock_data waypoint8)
   goals met: 4 of 26
23. (sample_rock rover3 rover3store waypoint3)
   deleted: (empty rover3store) (at_rock_sample waypoint3)
   added: (full rover3store) (have_rock_analysis rover3 waypoint3)
   goals met: 4 of 26
24. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 4 of 26
25. (communicate_rock_data rover3 general waypoint3 waypoint3 waypoint6)
   added: (communicated_rock_data waypoint3)
   goals met: 5 of 26
26. (calibrate rover2 camera3 objective7 waypoint1)
   added: (calibrated camera3 rover2)
   goals met: 5 of 26
27. (take_image rover2 waypoint1 objective3 camera3 colour)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective3 colour)
   goals met: 5 of 26
28. (communicate_image_data rover2 general objective3 colour waypoint1 waypoint6)
   added: (communicated_image_data objective3 colour)
   goals met: 6 of 26
29. (calibrate rover2 camera3 objective7 waypoint1)
   added: (calibrated camera3 rover2)
   goals met: 6 of 26
30. (navigate rover2 waypoint1 waypoint3)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint3)
   goals met: 6 of 26
31. (take_image rover2 waypoint3 objective2 camera3 colour)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective2 colour)
   goals met: 6 of 26
32. (communicate_image_data rover2 general objective2 colour waypoint3 waypoint6)
   added: (communicated_image_data objective2 colour)
   goals met: 7 of 26
33. (calibrate rover2 camera3 objective7 waypoint3)
   added: (calibrated camera3 rover2)
   goals met: 7 of 26
34. (take_image rover2 waypoint3 objective7 camera3 colour)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective7 colour)
   goals met: 7 of 26
35. (communicate_image_data rover2 general objective7 colour waypoint3 waypoint6)
   added: (communicated_image_data objective7 colour)
   goals met: 8 of 26
36. (calibrate rover2 camera1 objective2 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 8 of 26
37. (take_image rover2 waypoint3 objective2 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective2 high_res)
   goals met: 8 of 26
38. (communicate_image_data rover2 general objective2 high_res waypoint3 waypoint6)
   added: (communicated_image_data objective2 high_res)
   goals met: 9 of 26
39. (calibrate rover2 camera3 objective7 waypoint3)
   added: (calibrated camera3 rover2)
   goals met: 9 of 26
40. (navigate rover2 waypoint3 waypoint4)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint4)
   goals met: 9 of 26
41. (take_image rover2 waypoint4 objective1 camera3 colour)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective1 colour)
   goals met: 9 of 26
42. (communicate_image_data rover2 general objective1 colour waypoint4 waypoint6)
   added: (communicated_image_data objective1 colour)
   goals met: 10 of 26
43. (calibrate rover2 camera1 objective2 waypoint4)
   added: (calibrated camera1 rover2)
   goals met: 10 of 26
44. (navigate rover2 waypoint4 waypoint6)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint6)
   goals met: 10 of 26
45. (take_image rover2 waypoint6 objective6 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective6 low_res)
   goals met: 10 of 26
46. (navigate rover2 waypoint6 waypoint4)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint4)
   goals met: 10 of 26
47. (communicate_image_data rover2 general objective6 low_res waypoint4 waypoint6)
   added: (communicated_image_data objective6 low_res)
   goals met: 11 of 26
48. (calibrate rover2 camera1 objective2 waypoint4)
   added: (calibrated camera1 rover2)
   goals met: 11 of 26
49. (take_image rover2 waypoint4 objective2 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective2 low_res)
   goals met: 11 of 26
50. (communicate_image_data rover2 general objective2 low_res waypoint4 waypoint6)
   added: (communicated_image_data objective2 low_res)
   goals met: 12 of 26
51. (calibrate rover2 camera1 objective2 waypoint4)
   added: (calibrated camera1 rover2)
   goals met: 12 of 26
52. (take_image rover2 waypoint4 objective7 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective7 high_res)
   goals met: 12 of 26
53. (communicate_image_data rover2 general objective7 high_res waypoint4 waypoint6)
   added: (communicated_image_data objective7 high_res)
   goals met: 13 of 26
54. (calibrate rover2 camera1 objective2 waypoint4)
   added: (calibrated camera1 rover2)
   goals met: 13 of 26
55. (navigate rover2 waypoint4 waypoint6)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint6)
   goals met: 13 of 26
56. (navigate rover2 waypoint6 waypoint1)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint1)
   goals met: 13 of 26
57. (take_image rover2 waypoint1 objective3 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective3 low_res)
   goals met: 13 of 26
58. (communicate_image_data rover2 general objective3 low_res waypoint1 waypoint6)
   added: (communicated_image_data objective3 low_res)
   goals met: 14 of 26
59. (navigate rover2 waypoint1 waypoint3)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint3)
   goals met: 14 of 26
60. (calibrate rover2 camera1 objective2 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 14 of 26
61. (navigate rover2 waypoint3 waypoint1)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint1)
   goals met: 14 of 26
62. (take_image rover2 waypoint1 objective3 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective3 high_res)
   goals met: 14 of 26
63. (communicate_image_data rover2 general objective3 high_res waypoint1 waypoint6)
   added: (communicated_image_data objective3 high_res)
   goals met: 15 of 26
64. (navigate rover2 waypoint1 waypoint3)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint3)
   goals met: 15 of 26
65. (calibrate rover2 camera1 objective2 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 15 of 26
66. (take_image rover2 waypoint3 objective4 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective4 high_res)
   goals met: 15 of 26
67. (communicate_image_data rover2 general objective4 high_res waypoint3 waypoint6)
   added: (communicated_image_data objective4 high_res)
   goals met: 16 of 26
68. (calibrate rover2 camera1 objective2 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 16 of 26
69. (take_image rover2 waypoint3 objective5 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective5 high_res)
   goals met: 16 of 26
70. (communicate_image_data rover2 general objective5 high_res waypoint3 waypoint6)
   added: (communicated_image_data objective5 high_res)
   goals met: 17 of 26
71. (calibrate rover2 camera3 objective7 waypoint3)
   added: (calibrated camera3 rover2)
   goals met: 17 of 26
72. (navigate rover2 waypoint3 waypoint5)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint5)
   goals met: 17 of 26
73. (take_image rover2 waypoint5 objective6 camera3 colour)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective6 colour)
   goals met: 17 of 26
74. (navigate rover2 waypoint5 waypoint1)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint1)
   goals met: 17 of 26
75. (communicate_image_data rover2 general objective6 colour waypoint1 waypoint6)
   added: (communicated_image_data objective6 colour)
   goals met: 18 of 26
76. (navigate rover2 waypoint1 waypoint3)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint3)
   goals met: 18 of 26
77. (calibrate rover2 camera1 objective2 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 18 of 26
78. (take_image rover2 waypoint3 objective7 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective7 low_res)
   goals met: 18 of 26
79. (communicate_image_data rover2 general objective7 low_res waypoint3 waypoint6)
   added: (communicated_image_data objective7 low_res)
   goals met: 19 of 26
80. (calibrate rover2 camera3 objective7 waypoint3)
   added: (calibrated camera3 rover2)
   goals met: 19 of 26
81. (take_image rover2 waypoint3 objective4 camera3 colour)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective4 colour)
   goals met: 19 of 26
82. (communicate_image_data rover2 general objective4 colour waypoint3 waypoint6)
   added: (communicated_image_data objective4 colour)
   goals met: 20 of 26
83. (calibrate rover2 camera1 objective2 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 20 of 26
84. (take_image rover2 waypoint3 objective4 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective4 low_res)
   goals met: 20 of 26
85. (communicate_image_data rover2 general objective4 low_res waypoint3 waypoint6)
   added: (communicated_image_data objective4 low_res)
   goals met: 21 of 26
86. (calibrate rover2 camera1 objective2 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 21 of 26
87. (navigate rover2 waypoint3 waypoint4)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint4)
   goals met: 21 of 26
88. (take_image rover2 waypoint4 objective1 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective1 high_res)
   goals met: 21 of 26
89. (communicate_image_data rover2 general objective1 high_res waypoint4 waypoint6)
   added: (communicated_image_data objective1 high_res)
   goals met: 22 of 26
90. (calibrate rover2 camera3 objective7 waypoint4)
   added: (calibrated camera3 rover2)
   goals met: 22 of 26
91. (take_image rover2 waypoint4 objective5 camera3 colour)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective5 colour)
   goals met: 22 of 26
92. (communicate_image_data rover2 general objective5 colour waypoint4 waypoint6)
   added: (communicated_image_data objective5 colour)
   goals met: 23 of 26
93. (calibrate rover2 camera1 objective2 waypoint4)
   added: (calibrated camera1 rover2)
   goals met: 23 of 26
94. (take_image rover2 waypoint4 objective1 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective1 low_res)
   goals met: 23 of 26
95. (communicate_image_data rover2 general objective1 low_res waypoint4 waypoint6)
   added: (communicated_image_data objective1 low_res)
   goals met: 24 of 26
96. (calibrate rover2 camera1 objective2 waypoint4)
   added: (calibrated camera1 rover2)
   goals met: 24 of 26
97. (navigate rover2 waypoint4 waypoint6)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint6)
   goals met: 24 of 26
98. (take_image rover2 waypoint6 objective6 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective6 high_res)
   goals met: 24 of 26
99. (navigate rover2 waypoint6 waypoint4)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint4)
   goals met: 24 of 26
100. (communicate_image_data rover2 general objective6 high_res waypoint4 waypoint6)
   added: (communicated_image_data objective6 high_res)
   goals met: 25 of 26
101. (calibrate rover2 camera1 objective2 waypoint4)
   added: (calibrated camera1 rover2)
   goals met: 25 of 26
102. (take_image rover2 waypoint4 objective5 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective5 low_res)
   goals met: 25 of 26
103. (communicate_image_data rover2 general objective5 low_res waypoint4 waypoint6)
   added: (communicated_image_data objective5 low_res)
   goals met: 26 of 26
